# SQL 유튜브

1. DML(Data Manipulation language)

2. DDL(Data Definition language)

3. DCL(Data Control language)

## 실행언어 모음
- block을 씌우면 부분 실행 가능
- **;**: SQL query가 끝났다는 표시
- * : 모든 것(all)을 표현할 때 사용
- **SHOW databases** : MySQL서버에 Database가 뭐가 있는지 보여달라는 명령
- **USE 'database name'** : 사용할 데이터베이스 지정. 해당 database를 사용하게끔 하는 명령. 더블클릭으로도 가능 (두꺼운 글씨로 바뀌면 성공한 것)
- **SHOW table** : 데이터베이스의 테이블 이름 보기
- **SHOW table STATUS** : 데이터베이스의 테이블 정보 조회
- **DESCRIBE 'table name'** : 데이터 table에 무슨 열이 있는지 조회  
  **DESC** : 여기까지만 써도 됨

## Select
- **SELECT** : 데이터를 가져오는 구문. 데이터베이스 내 테이블에서 원하는 정보를 추출
  > `select의 구문 형식`  
   SELECT select_expr
    - [FROM table_references]    # column을 보고 싶을 때
    - [WHERE where_condition]   # row를 보고 싶을 때
    - [GROUP BY {col_name | expr | position}]
    - [HAVING where_condition]
    - [ORDER BY {col_name | expr | position}]
- **SELECT 'col_names' FROM 'table_name'** : table에서 원하는 col만 불러오기
- **SELECT 'col_names' FROM 'table_name'** where '조건' : table에서 원하는 col 중에서 원하는 row를 뽑기  
  **여기에** AND, OR 등의 관계 연산자들 사용가능!
- **SELECT * FROM 'table_name' WHERE 'column name' BETWEEN 'condition1' AND 'condition2** : between 문을 쓰는 방법

- **IN** : 이산적인 값의 조건에서 사용가능
- **BETWEEN**: 조건을 걸어줄 때 편리
- **WHERE**: 원하는 조건에 따라 데이터 선택 가능
- **LIKE**: 문자열의 내용 검색. 
  - 문자 뒤에 %: 무엇이든 허용
  - _: 한 글자만 매치하기 위함
- SUB QUERY: 쿼리문 안에 또 쿼리문이 들어 있는 것
  - ANY: sub query의 결과 중에 한 가지만 만족해도 가능
  - ALL: sub query의 결과를 모두 만족시켜야 함
- ORDER BY: 결과가 출력되는 순서를 조절하는 구문. Ascending이 default
- DISTINCT: 중복된 것을 1개씩만 보여주면서 출력, 테이블의 크기가 클수록 효율적
- LIMIT: 출력 개수를 제한. 상위의 N개만 출력하는 'limit n' 구문
- GROUP BY
: 그룹을 묶어주는 역할
  - avg( ): 평균
  - min( ): 최소값
  - max( ): 최대값
  - count( ): 행의 개수
  - count( distinct ): 중복 제외된 행의 개수
  - stdev( ): 표준 편차
  - variance( ): 분산
  - as 'column name': as를 붙이면 뒤에 원하는 column 이름이 옴
- HAVING: WHERE과 비슷한 개념으로 조건 제한. 반드시 group by절 다음에 나와야 함
- ROLLUP: 총합 또는 중간합계가 필요할 경우에 사용. GROUPY BY절과 함께 WITH ROLLUP문 사용
- JOIN: 데이터베이스 내의 여러 테이블에서 가져온 레코드를 조합하여 하나의 테이블이나 결과 집합으로 표현

> MySQL 내장 함수
- LENGTH( ): 전달받은 문자열의 길이를 반환
- CONCAT( ): 전달받은 문자열을 모두 결합하여 하나의 문자열로 반환
- LOCATE( ): 문자열 내에서 찾는 문자열이 처음으로 나타나는 위치를 찾아서 해당 위치를 반환. 찾는 문자열이 존재하지 않으면 0을 반환. MySQL은 문자열의 시작 index를 1부터 계산
- LEFT( ): 문자열의 왼쪽부터 지정한 개수만큼의 문자를 반환
- RIGHT( ): 문자열의 오른쪽부터 지정한 개수만큼의 문자를 반환
- LOWER( ): 문자열을 모두 소문자로 변경
- UPPER( ): 문자열을 모두 대문자로 변경
- REPLACE( ): 문자열에서 특정 문자열을 대체 문자열로 교체
- TRIM( ): 문자열의 앞 or 뒤 or 양쪽 모두에 있는 특정 문자를 제거  
  > 사용가능한 지정자
  - BOTH: 전달받은 문자열의 양 끝에 존재하는 특정 문자를 제거(Default)
  - LEADING: 전달받은 문자열 앞에 존재하는 특정 문자를 제거
  - TRAILING: 전달받은 문자열 뒤에 존재하는 특정 문자를 제거
- FORMAT( ): 숫자 타입의 데이터를 세 자리마다 쉼표를 사용하는 형식으로 변한. 반환되는 데이터는 str, 두 번째 인수는 반올림할 소수 부분의 자릿수
- FLOOR( ): 내림
- CEIL( ): 올림
- ROUND( ): 반올림
- SQRT( ): 양의 제곱근
- POW( ): 첫 번째 인수로는 밑수, 두 번째 인수로는 지수를 전달하여 거듭제곱 계산
- EXP( ): 인수로 지수를 전달받아, e의 거듭제곱을 계산
- LOG( ): 자연로그 값을 계산
- SIN( ): 사인값 반환
- COS( ): 코사인값 반환
- TAN( ): 탄젠트값 반환
- ABS(X): 절대값을 반환
- RAND( ): 0.0보다 크거나 같고 1보다 작은 하나의 실수를 무작위로 생성
- NOW( ): 현재 날짜와 시간을 반환 
- CURDATE( ): 현재 날짜를 반환
- CURTIME( ): 현재 시간을 반환
- DATE( ): 전달받은 값에 해당하는 날짜 정보를 반환
- MONTH( ): 월에 해당하는 값을 반환
- DAY( ): 일에 해당하는 값을 반환
- HOUR( ): 시간에 해당하는 값을 반환
- MINUTE( ): 분에 해당하는 값을 반환
- SECOND( ): 초에 해당하는 값을 반환
- MONTHNAME( ): 월 이름을 반환
- DAYNAME( ): 요일 이름을 반환
- DAYOFWEEK( ): 해당 주에서 몇 번째 날인지를 반환
- DAYOFMONTH( ): 해당 월에서 몇 번째 날인지를 반환
- DAYOFYEAR( ): 해당 연도에서 몇 번째 날인지를 반환
- DATE_FORMAT( ): 전달받은 형식에 맞춰 날짜, 시간 정보를 문자열로 반환

> MySQL 고급  
- CREATE TABLE AS SELECT: 테이블 생성
- CREATE DATABASE: 새로운 DB를 생성. USE문으로 새 DB를 사용
- CREATE TABLE table이름 ( ): 데이터 테이블 생성
- ALTER TABLE + ADD: 테이블에 column 추가
- ALTER TABLE + MODIFY: 테이블의 column 타입을 변경
- ALTER TABLE + DROP: 테이블의 column 제거
- CREATE INDEX: 인덱스를 생성
- SHOW INDEX: 인덱스 정보 보기
- CREATE UNIQUE INDEX: 중복값을 허용하지 않는 인덱스
- FULLTEXT INDEX: 일반적인 인덱스와는 달리 매우 빠르게 테이블의 모든 텍스트 컬럼을 검색
- ALTER / DROP INDEX: 인덱스 삭제하기

> VIEW
- DB에 존재하는 가상 테이블
- 실제로 데이터를 저장하지는 않음
- 여러 table이나 view를 하나의 table처럼 볼 수 있음
- 장점
  - 필요한 column만 보여줄 수 있음
  - 복잡한 query를 단순화가능
  - query 재사용 가능
- 단점
  - 한 번 정의한 view는 변경불가
  - 삽입, 삭제, 갱신 작업에 많은 제한이 있고
  - 고유의 index를 가질 수 없다.
- CREATE VIEW 이름 AS: 이렇게 View를 생성
- ALTER VIEW: View를 수정
- DROP VIEW: View를 삭제

- INSERT: 테이블 이름 다음에 나오는 열 생략 가능. 생략할 경우에 VALUE 다음에 나오는 값들의 순서 및 개수가 테이블이 정의된 열 순서 및 개수와 동일해야 함
- INSERT INTO SELECT: test 테이블에 있는 내용을 test2 테이블에 삽입
- UPDATE: 기존에 입력되어 있는 값을 변경하는 구문. WHERE절 생략이 되나 테이블 전체 행의 내용이 변경된다.
- DELETE: 행 단위로 데이터를 삭제. 원하는 데이터만 지울 수 있고 되돌릴 수도 있음
- TRUNCATE: 삭제 후 되돌릴 수 없음
- DROP TABLE: 테이블 전체를 삭제, 공간, 객체를 삭제. 삭제 후 복구 불가
- DROP DATABASE: 해당 데이터베이스를 삭제

In [0]:
## DROP DATABASE 예시
DROP DATABASE hyun;

In [0]:
## DROP TABLE 예시
DROP TABLE test

In [0]:
## TRUNCATE 예시
TRUNCATE TABLE test;

In [0]:
## DELETE 예시
DELETE FROM test
WHERE id =1;

In [0]:
## UPDATE 예시
UPDATE test
SET col1 = 1, col2=1.0, col3='test'
WHERE id =1

In [0]:
## INSERT INTO SELECT 예씨
INSERT INTO test2 SELCT * FROM test;

In [0]:
## INSERT 예시
INSERT INTO test
VALUE(1, 123, 1.1, "Test");

SELECT * FROM test;

In [0]:
## DROP VIEW
DROP VIEW testView

In [0]:
## ALTER VIEW
ALTER VIEW testView As
SELECT Col1, Col2, Col3
FROM test;

In [0]:
## CREATE VIEW 예시
CREATE VIEW testView AS
SELECT Col1, Col2
FROM test;

SELECT * FROM testView;

In [0]:
## DROP INDEX
# 예시1
ALTER TABLE test
DROP INDEX Col3Idx;

SHOW INDEX FROM test;

# 예시2: 이렇게 해도 됨
DROP INDEX Col2Idx ON test;

SHOW INDEX FROM test;

In [0]:
# FULLTEXT INDEX
ALTER TABLE test
ADD FULLTEXT Col3Idx(col3);

SHOW INDEX FROM test;

In [0]:
# CREATE UNIQUE
CREATE UNIQUE INDEX Col2Idx
ON test(col2);

SHOW INDEX FROM test;

In [0]:
# SHOW INDEX
SHOW INDEX FROM test;

In [0]:
# CREATE INDEX
CREATE INDEX Col1Idx
ON test (col1)

In [0]:
# ALTER TABLE, DROP
ALTER TABLE test2
DROP col4;

In [0]:
# ALTER TABLE MODIFY
ALTER TABLE test2
MODIFY col4 VARCHAR(20) NULL;

In [0]:
# ALTER TABLE
ALTER TABLE test2
ADD col4 INT NULL;

In [0]:
# CREATE TABLE
CREATE TABLE test2 (
    id INT NOT NULL PRIMARY KEY,
    col1 INT NULL,
    col2 FLOAT NULL,
    col3 VARCHAR(45) NU
）

In [0]:
# CREATE DATABASE
CREATE DATABASE hyun;

USE hyun;

In [0]:
# CREATE TABLE AS SELECT
CREATE TABLE city2 AS SELECT * FROM city;

In [0]:
# DATE_FORMAT()
SELECT
DATE_FORMAT(NOW(), %D %y %a %d %m %n %j)

In [0]:
# DAYOFWEEK(), DAYOFMONTH(), DAYOFYEAR()
SELECT
NOW(),
DAYOFWEEK(NOW());

In [0]:
# MONTHNAME(), DAYNAME()
SELECT
NOW(),
MONTHNAME(NOW()),
DAYNAME(NOW())

In [0]:
# DATE(), MONTH(), DAY(), HOUR(), MINUTE(), SECOND()
SELECT
NOW(),
DATE(NOW()),
MONTH(NOW()),
DAY(NOW()),
HOUR(NOW()),
MINUTE(NOW()),
SECOND(NOW())

In [0]:
# ABS(), RAND()
SELECT ABS(-3), RAND(), ROUND(RAND()*100, 0);

In [0]:
# SQRT( ), POW(), EXP(), LOG()
SELECT SQRT(4), POW(2,3), EXP(3), LOG(3)

In [0]:
# FLORR(), CEIL(), ROUND()
SELECT FLOOR(10.95), CEIL(10.95), ROUND(10.95)

In [0]:
# format
SELECT FORMAT(123123123123.123123123, 3);

In [0]:
# TRIM()
SELECT TRIM('                     MySQL         ');
TRIM(LEADING '#' FROM '###MySQL###').
TRIM(TRAILING '#' FROM'###MySQL###');

In [0]:
# REPLACE()
SELECT REPLACE('MSSQL', 'MS', 'MY');

In [0]:
# LOWER(), UPPER()
SELECT
LOWER('mYSQL ISA CDLSLDKCM ALSCKMDLS CLSMDCKL KLC')
UPPER('mYSQL ISA CDLSLDKCM ALSCKMDLS CLSMDCKL KLC')

In [0]:
# LEFT(), RIGHT()
SELECT
LEFT('mYSQL ISA CDLSLDKCM ALSCKMDLS CLSMDCKL KLC', 5)
RIGHT('mYSQL ISA CDLSLDKCM ALSCKMDLS CLSMDCKL KLC', 6)

In [0]:
# LOCATE()
SELECT LOCATE('abc', 'abcdkcslkdfkladf')

In [0]:
# concat 예시
SELECT CONCAT('My', 'sql OP'，'ENG)

In [0]:
# LENGTH()
SELECT LENGTH('alskdjf)

In [0]:
# JOIN 예시
# citry, country, countrylanguage 테이블 3개를 join 하기
SELECT *
FROM city
JOIN country ON city.CountryCode = country.Code
JOIN countrylanguage ON city.CountryCode = countrylanguage.CountryCode

In [0]:
# JOIN
SELECT *
FROM city
JOIN country ON city.CountryCode = country.Code

In [0]:
# ROLLUP
SELECT CountryCode, Name SUM(Population)
FROM city
GROUP BY CountryCode, Name WITH ROLLUP

In [0]:
# having
SELECT CoutnryCode, MAX(Populiation)
FROM city
GROUP BY CountryCode
HAVING MAX(Population) > 8000000

In [0]:
# city에서 population의 평균 구하기
SELECT ag(Population)
FROM city

In [0]:
# groupby as
SELECT CountryCode, avg(Population) AS 'Average'
FROM city
GROUP BY CountryCode

In [0]:
# groupby
SELECT CountryCode, Max(Population)
FROM city
GROUP BY CountryCode

In [0]:
# Limit
# 상위 10개만 보기
SELECT *
FROM city
ORDER BY Population DESC
LIMIT 10

In [0]:
# distinct
SELECT DISTINCT CountryCode
FROM city;

In [0]:
# 국가 면적 크기로 내림차순하기
SELECT *
FROM country
ORDER BY SurfaceArea DESC;

In [0]:
# 한국에 있는 도시들 인구수로 내림차순하기
SELECT *
FROM city
WHERE CountryCode = 'KOR'
ORDER BY Population DESC

In [0]:
# order by
# decending order
SELECT *
FROM city
ORDER BY Population DESC

# ascending order
SELECT *
FROM city
ORDER BY Population 

# multiple order by
SELECT *
FROM city
ORDER BY CountryCode ASC, Population DESC

In [0]:
# Sub query ANY
SELECT *
FROM city
WHERE Population > ANY ( select Population
                        FROM city
                        WHERE District = 'New York')

In [0]:
# Sub query
SELECT *
FROM city
WHERE CountryCode = ( SELECT CountryCode
                     FROM city
                     WHERE Name = 'Seoul');

In [0]:
# select 예시
SELECT * FROM city;    # city의 전체 row를 보여줘라
SELECT Name FROM city;
SELECT Name, Population FROM city;

In [0]:
# select where 예시
SELECT *
FROM city
WHERE Population > 8000000

# 이렇게 해도 됨
SELECT * FROM city WEHRE Population > 8000000

In [0]:
# select, where, 관계연산자 예시
## 예시1
SELECT *
FROM city
WHERE Population < 8000000
AND Population > 70000000

## 예시2
SELECT *
FROM city
WHERE CountryCode = 'KOR'
AND Population >= 1000000

In [0]:
# select, in 예시
SELECT *
FROM city
WHERE name IN('Seoul', 'New York', 'Tokyo')

In [0]:
# select, like 예시
## 예시1
WHERE *
FROM city
WHERE CountryCode LIKE 'KO_'

## 예시2
SELECT *
FROM city
WHERE CountryCode LIKE 'Tel %'

# 이기적 SQL 개발자 (Oracle base)

## 기타 SQL문

- SHOW DATABASES;: DB조회하기
- CREATE DATABASE 데이터베이스명;: DB 만들기
- USE 데이터베이스명;: DB 선택하기
- DESCRIBE 테이블명: 테이블 schema, 열 조회하기

## DDL(Data Definition Language)

- RDB의 구조를 정의하는 언어
- CREATE, ALTER, DROP 등등


> CREATE
- CREATE TABLE 테이블명 ( 칼럼명 칼럼특성 데이터타입 특징);
  - default, not null 등의 타입을 넣을 수 있음
- CREATE VIEW 뷰이름 AS SELECT * FROM 테이블명;: 뷰(view) 생성하기. 뷰란? 테이블로부터 유도된 가상의 테이블

> ALTER
- ALTER TABLE 테이블명 RENAME TO 새테이블명;: 테이블명 변경하기
- ALTER TABLE 테이블명 ADD (새칼럼명 데이터타입 특징);: 칼럼 추가하기
- ALTER TABLE 테이블명 MODIFY (컬럼명 데이터타입 특징);: 칼럼 변경하기
- ALTER TABLE 테이블명 DROP COLUMN 칼럼명;: 칼럼 삭제하기
- ALTER TABLE 테이블명 RENAME COLUMN 칼럼명 TO 새칼럼명;: 칼럼 이름 바꾸기

> DROP
- DROP TABLE 테이블명;: 테이블 삭제하기
- DROP TABLE 테이블명 CASCADE CONSTRAINT;: 테이블 삭제하기. 참조된 제약사항도 모두 삭제
- DROP TABLE 테이블명 CASCADE CONSTRAINT;: 참조된 제약사항도 모두 삭제하기
- DROP VIEW 뷰이름;: 뷰 삭제하기

> DELETE
- DELETE FROM 테이블명 WHERE 조건 = 조건;

In [0]:
# constraints 쓰는 법
CREATE TABLE dept
(
    deptno VARCHAR(4) primary key,
    deptname VARCHAR(20)
);

CREATE TABLE emp
(
    empno int(10),
    ename VARCHAR(15), 
    sal int(10) default 0,
    deptno VARCHAR(4) NOT NULL,
    createdata int(10) default 2,
    CONSTRAINT emppk PRIMARY KEY(empno),
    CONSTRAINT deptfk FOREIGN KEY(deptno)    # deptfk 외래키 이름
                      REFERENCES dept(deptno)
                      ON DELETE CASCADE      # 참조하고 있는 테이블의 데이터가 삭제되면 자동으로 삭제되는 옵션
);

## DML(Data Manipulation Language)

- 테이블에서 데이터를 입력, 수정, 삭제, 조회함
- INSERT, UPDATE

> INSERT
- INSERT INTO 테이블명 (칼럼명1, 칼럼명2) VALUES (값1, 값2);: 칼럼에 데이터 입력하기, 칼럼명은 생략할 수 있다. 저장하기 위해서는 commit해야 됨.
- INSERT INTO 테이블1 SELECT * FROM 테이블2;: 테이블2의 모든 데이터를 테이블1에 넣는다.
<br>

> ALTER
- ALTER TABLE 테이블명 NOLOGGING;: 로그파일의 기록을 남기지 않아 입력 시 성능을 향상시키는 방법!
- UPDATE 테이블명 SET 컬럼명&조건 WHERE 조건;: 입력된 데이터의 값을 수정하기 위함, 조건 미입력 시 모든 데이터가 수정됨
<br>

> DELETE
- DELETE FROM 테이블명 WHERE 칼럼명&조건: 원하는 조건을 검색해서 행을 삭제. 조건 미입력 시 모든 데이터 삭제
- DELETE FROM 테이블명;: 테이블의 모든 데이터를 삭제. 용량이 감소하지는 않음
- TRUNCATE TABLE 테이블명;: 테이블의 모든 데이터를 삭제함. 용량이 초기화됨
<br>

> SELECT
- SELECT 칼럼명 FROM 테이블명 LIMIT 숫자;: 조회를 제한할 수 있다.
- SELECT 칼럼명1, 칼럼명2 FROM 테이블명 WHERE 조건;: 데이터 조회. 원하는 칼럼 선택하기 (*)

>> ORDER BY
- SELECT 칼럼명 FROM 테이블명 ORDER BY 칼럼명1 ASC, 칼럼명2 DESC;: 정렬할 때 사용, ORDER BY의 default는 ASC이다.
- SELECT DISTINCT 칼럼명 FROM 테이블명 ORDER BY 칼럼명;: 중복된 데이터를 한 번만 조회함

>> Alias
- SELECT 칼럼명 AS "줄인이름" FROM 테이블명 테이블약칭 WHERE 조건;: Alias 사용방법

>> WHERE
- SELECT 칼럼명 FROM 테이블명 WHERE 조건1 AND 조건2;: 복수 조건 이용하기
- SELECT 칼럼명 FROM 테이블명 WHERE 조건1 OR 조건2;: 복수 조건 이용하기

>> LIKE
- SELECT 칼럼명 FROM 테이블명 WHERE 조건1 LIKE '%';: 와일드카드 사용하기
- SELECT 칼럼명 FROM 테이블명 WHERE 조건1 LIKE '_';: 와일드카드 사용하기

>> BETWEEN
- SELECT 칼럼명 FROM 테이블명 WHERE 칼럼명 BETWEEN 조건1 AND 조건2;: BETWEEN문 사용하기
- SELECT 칼럼명 FROM 테이블명 WHERE 칼럼명 NOT BETWEEN 조건;: NOT BETWEEN문 사용하기

>> IN
- SELECT 칼럼명 FROM 테이블명 WHERE 칼럼명 IN (조건1, 조건2);: IN문 싸용하기

>> IS NULL
- SELECT 칼럼명 FROM 테이블명 WHERE 칼럼명 IS NULL;: 칼럼 속에서 null값 조회하기
- SELECT 칼럼명 FROM 테이블명 WHERE 칼럼명 IS NOT NULL;: 칼럼 속에서 null값 아닌 거 조회하기
- SELECT IFNULL(칼럼명, 값) FROM 테이블명;: null값 처리하기

> GROUP
>> GROUP BY
- 소규모 행을 그룹화하여 합계, 평균, 최대값, 최소값 등을 계산
- HAVING구에 조건문을 사용함
- ORDER BY로 정렬할 수 있다.

>> HAVING
- GROUP BY에 조건절을 사용하기 위해 HAVING을 사용해야 함.

> DECODE
- IF문으로 구현. 조건이 참이면 A, 거짓이면 B를 반환
- DECODE(칼럼, 조건, A, B)

> CASE
- 조건문 사용!
- CASE  
  WHEN 조건1 THEN 결과1
  WHEN 조건2 THEN 결과2
  WHEN 조건3 THEN 결과3
  ELSE 결과4
  END

> ROWNUM
- 조회되는 행 수를 제한할 때 사용

> ROWID
- Orcale DB 내에서 데이터를 구분할 수 있는 유일한 값

> WITH
- 서브쿼리를 사용해서 임시 테이블이나 뷰처럼 사용할 수 있는 구문

> 집계함수 종류
- COUNT(), COUNT(*)은 NULL 값을 포함한 모든 행수를 계산
- SUM()
- AVG()
- MAX(), MIN()
- STDDEV()
- VARIAN()

> SELECT문 실행순서
- FROM => WHERE => GROUP BY => HAVING => SELECT => ORDER BY

> 형변환
- TO_NUMBER(문자열)
- TO_CHAR
- TO_DATE(문자열, 포맷)

> 내장형 함수
- ACSII(문자): 문자, 숫자를 ACSII 코드 값으로 변환함
- CHAR(ACSII코드값): ACSII 코드 값을 문자로 변환
- SUBSTR(문자열,m,n): 문자열에서 m번쨰 위치부터 n개를 자른다.
- CONCAT(문자열1, 문자열2): 결합하기!
- LOWER(문자열): 소문자 변환
- UPPER(문자열): 대문자 변환
- LEN(문자열): 길이 반환
- LTRIM(문자열, 지정문자): 왼쪽에 지정된 문자를 삭제, 없으면 공백 삭제
- RTRIM(문자열, 지정문자): 오른쪽에 지정된 문자를 삭제, 없으면 공백 삭제
- TRIM(문자열, 지정문자): 양쪽에 지정된 문자를 삭제, 없으면 공백 삭제
- ABS(숫자): 절대값 반환
- SIGN(숫자): 양수, 음수, 0을 구별
- MOD(숫자1, 숫자2): 나머지 계산, %
- CEIL(숫자), CEILING(숫자): 높은 정수 반환
- FLOOR(숫자): 낮은 정수 반환
- ROUND(숫자, m): 소수점 m 자리에서 반올림
- TRUNC(숫자, m): 소수점 m 자리에서 절삭

In [0]:
# WITH 예시
WITH viewData AS
(SELECT * FROM emp
 UNION ALL
 SELECT * FROM emp
 )
SELECT * FROM viewData WHERE empno=1000;

In [0]:
# DECODE 예시
SELECT DECODE(empno, 1000, 'TRUE', 'FALSE') FROM emp;

In [0]:
# GROUP BY 예시
SELECT deptno, SUM(sal) FROM emp
WHERE empno BETWEEN 1000 AND 1003
GROUP BY deptno;

In [0]:
# COUNT(*)
SELECT COUNT(*) FROM emp;

In [0]:
# HAVING 예시
SELECT deptno, SUM(sal)
FROM emp
GROUP BY deptno
HAVING SUM(sal) > 10000;

In [0]:
# GROUP BY 예시
SELECT deptno, SUM(sal)
FROM emp
GROUP BY deptno;

In [0]:
# IFNULL() 예시
SELECT IFNULL(SALARY, 0) FROM EMPLOYEE_SALARY # SALARY 값이 NULL 이면 0을, NULL 이 아니면 SALARY 값을 출력

In [0]:
# BETWEEN 예시
SELECT * FROM students WHERE height NOT BETWEEN 160 AND 180;

In [0]:
# IN 예시
SELECT * FROM students WHERE name in ('기장우', '박성재');

In [0]:
# 와일드카드 예시1
SELECT * FROM students
WHERE name LIKE '정%';  # '정'씨 모두 찾기

# 와일드카드 예시2
SELECT * FROM students
WHERE name LIKE '%우';   # '우'로 끝나는 사람 찾기

# 와일드카드 예시3
SELECT * FROM students
WHERE ENAME LIKE '%현%'   # 중간에 '현'이 있는 모든 데이터 조회

# 와일드카드 예시4
SELECT * FROM students
WHERE ENAME LIKE '정현_'   # '정현'뒤에 하나의 글자만 더 있는 것을 조회

In [0]:
# Alias 사용 예시
SELECT full_family_name AS 'name' FROM student m
WHERE m.score = 100;

## DCL(Data Control Language)

- 사용자에게 권한을 부여하거나 회수한다.

> GRANT
- DB 사용자에게 권한을 부여
- 권한 종류로는 SELECT, INSERT, UPDATE, DELETE, REFERENCES, ALTER, INDEX, ALL가 있다.
- WITH GRANT OPTION, WITH ADMIN OPTION도 부여가능
- GRANT 권한 ON 테이블명 TO user;


> REVOKE
- 권한을 회사
- REVOKE 권한 ON 테이블명 FROM user;

In [0]:
# GRANT문 예시1
GRANT SELECT, INSERT, UPDATE, DELETE
ON emp
TO user-name;

## TCL(Trarnsaction Control Language)

- 트랜잭션을 제어하는 명령어

> COMMIT
- 변경한 데이터를 DB에 반영
- 변경 전 데이터는 잃어버림

> ROLLBACK
- 데이터에 대한 변경 사용을 모두 취소하고 트랜잭션을 종료
- rollback;

> SAVEPOINT
- 트랜잭션을 작게 분할하여 관리
- 지정된 위치까지만 트랜잭션을 ROLLBACK할 수 있음
- savepoint 이름;
- rollback to savepoint이름;

## 고급 SQL


> JOIN
- SELECT 칼럼명 FROM 테이블1, 테이블2 WHERE 조건;: 테이블 합치기
- SELECT 칼럼명 FROM 테이블1 INNER JOIN 테이블2 ON 조건;: Inner join 하기. join문에 조건 및 정렬가능

> INTERSECT
- SELECT 칼럼명 FROM 테이블명 WHERE 조건
 INTERSECT
  SELECT 칼럼명 FROM 테이블명 WHERE 조건;: 교집합을 조회한다.

> LEFT, RIGHT, CROSS JOIN
- 정확하게 일치하지 않는 것을 조인하는 것.
- (+)=로 OUTER JOIN을 할 수 있음
- SELECT 칼럼명 FROM 테이블1 LEFT OUTER JOIN 테이블2 ON 조건;: LEFT OUTER JOIN
- SELECT 칼럼명 FROM 테이블1 RIGHT OUTER JOIN 테이블2 ON 조건;: RIGHT OUTER JOIN 
- SELECT 칼럼명 FROM 테이블1 CROSS JOIN 테이블2;: CROSS JOIN하기

> UNION
- UNION 연산은 두 개의 테이블을 하나로 합치는 것이다. 테이블 칼럼 수, 형식이 모두 일치해야 함
- 중복된 데이터는 알아서 제거함
- SELECT 칼럼명 FROM 테이블1  
  UNION  
  SELECT 칼럼명 FROM 테이블2;: 이게 기본 method

> UNION ALL
- 중복을 제거하거나 정렬을 하지 않음
- SELECT 칼럼명 FROM 테이블1  
  UNION ALL
  SELECT 칼럼명 FROM 테이블2;

> MINUS
- 차집합을 만드는 방법으로 먼저 쓴 SELECT문에 있고 뒤 SELECT문에 없는 것을 조회
- SELECT 칼럼명 FROM 테이블1  
  MINUS  
  SELECT 칼럼명 FROM 테이블2;

> Subquery
- SELECT문 속에 SELECT문이 있는 SQL문.
- 단일 행 subquery: 하나의 행만 반환하는 서브쿼리
- 다중 행 subquery: 여러 개의 행을 반환하는 subquery. IN, ANY, ALL, EXISTS 등 다중 행 비교연산자를 사용해야 함.
>> IN
  - subquery 결과 중 하나만 동일하면 참(OR조건)  

>> ALL
  - 메인쿼리와 서브쿼리의 결과가 모두 동일하면 참

>> EXISTS
  - Subquery로 어떤 데이터 존재 여부를 확인하기

>> Scale Subquery
  - 반드시 한 행과 한 칼럼만 반환하는 서브쿼리
  - 여러 행이 반환되면 오류가 발생함

>> Correlated Subquery
  - Subquery 내에서 Main Query 내의 칼럼을 사용하는 것
  
> Inline view
- FROM문에 SELECT문을 사용한 것

> Group
>> Rollup
  - GROUP BY의 칼럼에 대해서 Subtotal을 만들어줌

>> GROUPING
  - ROLLUP, CUBE, GROUPING SETS에서 생성되는 합계 값을 구분하기 위한 함수
  
>> GROUPING SETS
  - GROUP BY에 나오는 칼럼 순서와 관계없이 다양한 소계를 만들 수 있음
  - 칼럼의 순서와 관계없이 개별적으로 모두 처리함

> CUBE
- 제시한 칼럼에 대해서 결합 가능한 모든 집계를 계산한다.

In [0]:
# CUBE 예시
SELECT deptno, job, SUM(sal)
FROM emp
GROUP BY CUBE(deptno, job);

In [0]:
# GROUPING SETS 예시
SELECT deptno, job, SUM(sal)
FROM emp
GROUP BY GRORUPING SETS(deptno, job);

In [0]:
# GROUPING 예시1
SELECT deptno, GROUPING(deptno),
job, GROUPING(job), SUM(sal)
FROM emp
GROUP BY ROLLUP(deptno)

# GROUPING 예시2
SELECT deptno, 
DECODE(GROUPING(deptno), 1, '전체합계'), tot, job,
DECODE(GROUPING(job), 1, '부서합계') t_dept,
SUM(sal)
FROM emp
GROUP BY ROLLUP(deptno)

In [0]:
# ROLLUP 예시1
SELECT DECODE(deptno, NULL, '전체합계', deptno),
SUM(sal)
FROM emp
GROUP BY ROLLUP (deptno);

# ROLLUP 예시2
SELECT deptno, job, SUM(sal)
FROM emp
GROUP BY ROLLUP (deptno, job);

In [0]:
# Correlated Subquery
FROM emp a
WHERE a.deptno = 
( SELECT deptno FROm dept b
 WHERE b.deptno = a.deptno);

In [0]:
# Scala Subquery
SELECT ename AS "이름"
sal AS "급여" (
    SELECT AVG(sal)
    FROM emp) AS "평균급여"
    FROM emp
    WHERE empno=1000;

In [0]:
# EXISTS
SELECT ename, dname, sal
FROM emp, dept
WHERE emp.deptno=dept.deptno
AND EXISTS (SELECT 1 FROM emp
            WHERE sal > 2000);

In [0]:
# ALL 예시
SELECt *
FROM emp
WHERE deptno <= ALL (20, 30);

In [0]:
# IN 예시
SELECT ename, dname, sal
FROM emp, dept
WHERE emp, deptno = depf.deptno
AND emp, empno
IN (SELECT empno FROM emp
    WHERE sal > 2000); # 급여(SAL)가 2000원 이상인 사원번호를 조회한 후에 EMP, EMPNO를 조회한다.

In [0]:
# Subquery 예시
SELECT *
FROM emp
WHERE deptno = (
    SELECT deptno FROM dept 
    WHERE deptno = 10 
);

In [0]:
# Inline View 예시
SELECT *
FROM (SELECT rownum num,enmae FROM emp) a
WHERE num < 5;

In [0]:
# OUTER JOIN 예시
SELECT * FROM dept, emp
WHERE emp.deptno (+)= dept.deptno;

In [0]:
# INNER JOIN 예시1
SELECT * FROM emp 
INNER JOIN dept
ON emp.deptno = dept.deptno;

# INNER JOIN 예시2
SELECT * FROM emp, dept
WHERE emp.deptno = dept.deptno
AND emp.ename = LIKE '임%'
ORDER BY ename;

![](https://t1.daumcdn.net/cfile/tistory/23660A34583405E938)

In [0]:
# JOIN 예시 1
SELECT gg._id, gg.name, s.title
FROM girl_group AS gg 
JOIN song AS s
ON s._id = gg.hit_song_id;

# JOIN 예시 2
SELECT * FROM emp, dept
WHERE emp.deptno = dept.deptno;